{
  "flashcards": [
    {
      "category": "Education/Career",
      "chinese": "我在 2024 年大学毕业，然后被一家饮料公司雇佣。我在那里待了大约一年。之后，我辞职了，因为我感觉有点累，而且挣不到多少钱。",
      "english": "I graduated from uni in 2024, and then I was hired by a beverage company. I stayed there for about one year. After that, I quit because I felt a little tired and there wasn't much I could earn.",
      "type": "sentence"
    },
    {
      "category": "Career Choice",
      "chinese": "我选择这份工作的原因是，这家公司能提供一个很好的平台让我锻炼沟通技巧，并增加我的职业经验。",
      "english": "The reason why I chose this job is that this company could provide a great platform for me to practice my communication skills and increase my professional experience.",
      "type": "sentence"
    },
    {
      "category": "Career Choice",
      "chinese": "正如我所说，这份工作主要是提升我的社交技能，而最重要的原因是他们承诺给我高薪。",
      "english": "As I was saying, this job can mostly improve my social skills, and the most important reason is they promised to pay me a high salary.",
      "type": "sentence"
    },
    {
      "category": "Work Experience",
      "chinese": "我在零售业工作。我认为这份工作最困难的事情是应对许多顾客的拒绝。而且有时我不得不面对他们的一些坏情绪。",
      "english": "I was in retail. So, I think the most difficult thing about my job was dealing with rejection from many customers. And sometimes I had to deal with some of their bad moods.",
      "type": "sentence"
    },
    {
      "category": "Work Environment",
      "chinese": "我更喜欢与他人合作。刚开始工作时，我遇到了很多问题，但一位资深同事真的手把手指导我，教我入门。",
      "english": "I prefer working with others. When I first started my job, I ran into a lot of problems, but a senior colleague really took me under their wing and showed me the ropes.",
      "type": "sentence"
    },
    {
      "category": "Personal Growth",
      "chinese": "我的销售工作确实激发了我的勇气。我遇到了很多拒绝，也应对了难缠的客户，但我从未放弃。我必须迎难而上，这迫使我变得坚强勇敢。",
      "english": "My job in sales really brought out my courage. I got a lot of rejection and dealt with difficult clients, but I never gave up. I had to sink or swim, and that forced me to develop a thick skin and become brave.",
      "type": "sentence"
    },
    {
      "category": "Future Career",
      "chinese": "我想从事数据分析相关的工作。我意识到销售并不是我长远的发展方向。我相信重要的是去追随你真正热爱的事业。",
      "english": "I'm aiming for a career in data analysis. I've realized that sales isn't really where I see myself long-term. I believe it's important to follow a path that you truly love.",
      "type": "sentence"
    },
    {
      "category": "Volunteering",
      "chinese": "我通常去广州市第一人民医院做志愿者工作。我们致力于让这些孩子像健康正常的孩子一样互相玩耍（或一起玩）。我们有音乐课、绘画课和故事课。",
      "english": "I usually go to Guangzhou's No. 1 Hospital to do volunteer work. We focus on letting these children play with (hang out with) each other, just like those who are healthy and normal. We have music lessons, drawing lessons, and story lessons.",
      "type": "sentence"
    },
    {
      "category": "Hobbies",
      "chinese": "嗯，我喜欢古典音乐，比如钢琴和小提琴。我五岁时开始学钢琴。弹钢琴的时候，我觉得很有意义，就像在和自己对话一样。",
      "english": "Well, I like classical music, such as the piano and the violin. I started to learn the piano when I was 5 years old. When I play the piano, I feel it's so meaningful, just like talking with myself.",
      "type": "sentence"
    },
    {
      "category": "Hobbies",
      "chinese": "当然我喜欢阅读！阅读是我最喜欢的爱好。通过阅读这么多书，我获得了世界各地不同的知识。即使我不能亲自走到那里，但可以通过阅读一些书来拓宽我的视野。",
      "english": "Of course I like reading! Reading is my most favorite hobby. By reading so many books, I gain more knowledge about different places around the world. Even though I can't go there by foot, I can read some books to broaden my horizons.",
      "type": "sentence"
    },
    {
      "category": "Hobbies/Pets",
      "chinese": "事实上，我更喜欢户外活动。因为我有一只宠物狗，叫贝贝，是一只雌性边境牧羊犬。你知道，狗需要大量的运动，所以我每周都去徒步。我甚至买了辆车，这样我就可以开到任何我想去的地方。我认为户外活动对我的狗来说是健康快乐的。",
      "english": "In fact, I prefer outdoor activities. Because I have a pet dog, called Beibei, a female Border Collie. You know, dogs need a lot of exercise, so I go hiking weekly. I even bought a car so that I can drive anywhere I want. I think outdoor activities are healthy and happy for my dog.",
      "type": "sentence"
    },
    {
      "category": "Hobbies",
      "chinese": "实际上，我的爱好一直是阅读。由于我父母的工作——他们是学校的老师——我小时候去得最多的地方就是图书馆。我认为阅读是提高知识的好方法，这就是我过去一直保持阅读的原因。",
      "english": "Actually, my hobby has always been reading. Because of my parents' jobs—they are teachers at the school—the place I visited the most when I was a child was the library. I think reading is a good way to improve my knowledge; that's why I kept reading in the past.",
      "type": "sentence"
    },
    {
      "category": "Hobbies/Value",
      "chinese": "是的，爱好是人们生活中最重要的组成部分之一。一个良好有趣的爱好可以帮助人们缓解压力，创造一些有意义的回忆。就我而言，我喜欢阅读，它可以拓宽我的视野。",
      "english": "Yes, a hobby is one of the most important parts of a person's life. A good and interesting hobby can help people relieve stress and create some meaningful memories. As for me, I like reading, which can broaden my horizons.",
      "type": "sentence"
    },
    {
      "category": "Future Hobbies",
      "chinese": "当然，我想尝试潜水。我认为大海非常神秘。海洋生物有其独特的魅力。我男朋友擅长潜水。也许将来我会选择潜水作为我的爱好。",
      "english": "Of course, I want to try diving. I think the sea is very mysterious. Marine life has its unique charm. My boyfriend is good at diving. Maybe I will choose diving to be a hobby in the future.",
      "type": "sentence"
    },
    {
      "category": "Daily Routine",
      "chinese": "我的日常生活很正常也很充实。我每天早上 7:30 醒来，然后去游泳一小时。之后我就回家了。",
      "english": "My typical life is normal and fulfilling/enriched. Every day, I wake up at 7:30 AM and go swimming for one hour. After that, I go home.",
      "type": "sentence"
    },
    {
      "category": "Daily Routine",
      "chinese": "是的，我每天都做同样的事情。",
      "english": "Yes, I do the same things every day.",
      "type": "sentence"
    },
    {
      "category": "Daily Routine",
      "chinese": "通常，我早上 7:30 醒来。然后我会去游泳池做晨练。此外，我可能会在早上 9:00 回家和家人一起吃早餐。",
      "english": "Usually, I wake up at 7:30 AM. Then I go to the swimming pool for morning exercise. Furthermore, I may be back home at 9:00 AM and have breakfast with my family.",
      "type": "sentence"
    },
    {
      "category": "Daily Routine",
      "chinese": "通常，和家人吃完晚饭后，我会阅读大约两个小时的书籍。我也会在书上做一些笔记。我觉得这很有意义。",
      "english": "Usually, after finishing dinner with my family, I will read some books for about 2 hours. I also take some notes on them. I think it is very meaningful.",
      "type": "sentence"
    },
    {
      "category": "Daily Routine/Weekend",
      "chinese": "有时，在周末，我会和我的狗一起去远足。我们会去一些公园露营并进行一些活动，比如踢足球和玩飞盘。",
      "english": "Sometimes, on weekends, I go hiking with my dog. We go to some parks for camping and do some activities, such as playing football and frisbee.",
      "type": "sentence"
    },
    {
      "category": "Daily Routine/Habits",
      "chinese": "实际上，我每天早上都起得很早。因为我认为早起能让我的身体更健康。而且我认为早起可以有更多的时间来做自己的事情。",
      "english": "Actually, I wake up early every morning because I think waking up early can make my body healthier. And I think waking up earlier allows me to have more time for personal things.",
      "type": "sentence"
    },
    {
      "category": "Daily Routine",
      "chinese": "不，我最近通常保持正常的作息。",
      "english": "No, I usually stick to my normal routine recently.",
      "type": "sentence"
    },
    {
      "category": "Family",
      "chinese": "我的家庭有六个人：我的父母、我的妹妹和我的祖父母。",
      "english": "There are six people in my family: my parents, my younger sister, and my grandparents.",
      "type": "sentence"
    },
    {
      "category": "Family",
      "chinese": "当然，是我的妈妈。我的妈妈就像我的朋友一样。我们聊生活中的一切，比如我的日常生活、我的工作和我的学习。",
      "english": "Of course, it's my mother. My mother is just like my friend. We talk about everything in our lives, such as my daily life, my work, and my studies.",
      "type": "sentence"
    },
    {
      "category": "Family",
      "chinese": "我花更多时间陪伴我的家人。因为我认为家庭是我生命中最重要的部分之一。我的父母抚养我长大，所以我想回报他们。",
      "english": "I spend more time with my family because I think family is one of the most important parts of my life. My parents raised me, and I want to give back to them.",
      "type": "sentence"
    },
    {
      "category": "Family/Friends",
      "chinese": "是的，我有一个表姐/表妹。她住在广州，正在完成她的硕士学位。我经常去她的大学和她聊天，并在她大学周围骑自行车。",
      "english": "Yes, I have a cousin. She lives in Guangzhou, finishing her master's degree. I often go to her university to chat with her and ride bikes around her uni.",
      "type": "sentence"
    },
    {
      "category": "Friends",
      "chinese": "实际上，我的朋友们住得很近。我们每周都会一起出去玩，玩得很开心。",
      "english": "Actually, my friends live close to each other. We hang out together and have fun weekly.",
      "type": "sentence"
    },
    {
      "category": "Friendship",
      "chinese": "我更喜欢有一小群朋友，因为我认为我们联系的频率很高。我的朋友们住得很近，我们每周都会一起出去玩，玩得很开心。",
      "english": "I prefer having a small group of friends because I think the frequency of our connection is high. My friends live close to each other, and we hang out together and have fun weekly.",
      "type": "sentence"
    },
    {
      "category": "Food/Diet",
      "chinese": "事实上，我现在正在减肥，所以我喜欢绿色蔬菜。它们健康且低卡路里，并提供维生素和膳食纤维。",
      "english": "In fact, I am losing weight now, so I like green vegetables. They are healthy and low-calorie, and provide vitamins and dietary fiber.",
      "type": "sentence"
    },
    {
      "category": "Food/Cooking",
      "chinese": "是的，我每天都在家做午餐和晚餐。因为快餐对我的健康有害，所以我通常自己做饭。煮蔬菜很简单。",
      "english": "Yes, I cook at home every day for lunch and dinner. Because fast food is harmful to my health, I usually cook by myself. It is simple to boil vegetables.",
      "type": "sentence"
    },
    {
      "category": "Family/Cooking",
      "chinese": "我妈妈现在没有工作，长期呆在家里。我妈妈擅长做披萨，非常美味。",
      "english": "My mother has no job now and stays at home most of the time. My mom is good at making pizza; it is so delicious.",
      "type": "sentence"
    },
    {
      "category": "Food Preference",
      "chinese": "我更喜欢在家吃饭，因为食物没有添加剂。在餐馆里，你看不到他们制作食物的过程。",
      "english": "I prefer to eat at home because the food has no additives. In restaurants, you don't see the process while they are making the food.",
      "type": "sentence"
    },
    {
      "category": "Food Preference",
      "chinese": "我最喜欢粤菜。因为我住在广东，这里的人都喜欢清淡的食物，我也是。我认为全天然食物能让我的身体感觉更轻盈。",
      "english": "I like Cantonese cuisine the most. Because I live in Guangdong, the people living here all like light food, and so do I. I think all-natural foods can make my body feel lighter.",
      "type": "sentence"
    },
    {
      "category": "Food/Cooking",
      "chinese": "是的，当然。我在大学时学会了做饭。我一个人住，必须自己做饭。而且，它还能省钱。",
      "english": "Yes, of course. I learned to cook when I was at uni. I lived alone, and I had to cook by myself. Plus, it saved money.",
      "type": "sentence"
    },
    {
      "category": "Food Dislike",
      "chinese": "我不喜欢羊肉。不仅因为羊羔很可爱，还因为羊肉带有一些不愉快的膻味。",
      "english": "I don't like mutton. Not only because the lambs are very cute, but also because the mutton has a somewhat unpleasant smell.",
      "type": "sentence"
    }
  ]
}
